{"to":"nitin.0759@gmail.com","cc":"","bcc":"","subject":"Request for Media Coverage and Support in Seeking Justice for Rajkumar Jat","body":"Dear Nitin Soni,\r\n\r\nWe’re reaching out with deep urgency and hope. As journalists and platforms committed to truth, accountability, and public interest, we believe you can help amplify a case that desperately needs national attention.\r\n\r\nWe are seeking justice for Rajkumar Jat, a 24-year-old UPSC aspirant from Bhilwara, Rajasthan. A boy with nothing but dreams in his eyes and determination in his heart—he studied day and night to serve this country, to uphold the very Constitution that now seems to have failed him. On 4th March, Rajkumar was brutally murdered in Gondal, Gujarat. His body showed signs of severe torture. The most heartbreaking part? The prime accused is allegedly the son of a sitting BJP MLA.\r\n\r\nRajkumar’s family is shattered. They have no political power, no media backing—only pain, truth, and the hope that someone will listen. Their voices have been ignored, and the system has tried to bury the facts. A young life was taken, and it’s being called an \"accident.\" But the forensic report, the injuries, the timeline—none of it adds up. This is not just a family’s tragedy. It’s a failure of justice, unless we all step in.\r\n\r\nWe are attaching all relevant information, documents, and links below. Your platform can play a crucial role in bringing public awareness and pressuring authorities to act fairly. Even one story, one video, one mention could shift the course of this fight.\r\n\r\nIf you wish to speak directly to the family, they are open and available:\r\n\r\nArjun Ji (Rajkumar’s Brother-in-law): 9828919582\r\n\r\nPooja Jat (Rajkumar’s Sister): 9672801823\r\n\r\nSome media outlets like Poi, Lallantop, and Aaj Tak have already highlighted the case:\r\nhttps://www.youtube.com/watch?v=3sLHfeuvrGI&t=3s\r\n\r\nAll supporting materials are available here:\r\nhttps://drive.google.com/drive/folders/1srXwF2-Zz8yYrDGar242lOK4Mc6z8S2D?usp=drive_link\r\n\r\nWe are also raising funds to support Rajkumar’s family in their legal battle. If your team feels it’s appropriate to include, here is the donation link:\r\nhttps://milaap.org/fundraisers/support-ratanlal-jat\r\n\r\nPlease help us carry Rajkumar’s story forward. His voice was silenced, but together, we can make sure his fight for justice is not.\r\n\r\nWith deep respect.\r\n\r\nThank you"}
